Autodesk.Navisworks.Api.DocumentFileException
The exception that is thrown by file operation methods in Document

Autodesk.Navisworks.Api.DocumentFileException.#ctor
Creates a DocumentFileException

Autodesk.Navisworks.Api.DocumentFileException.#ctor(System.Runtime.Serialization.SerializationInfo,System.Runtime.Serialization.StreamingContext)
Creates a DocumentFileException

Autodesk.Navisworks.Api.DocumentFileException.#ctor(System.String)
Creates a DocumentFileException
message: The error message that explains the reason for the exception.

Autodesk.Navisworks.Api.DocumentFileException.#ctor(System.String,System.Exception)
Creates a DocumentFileException
message: The error message that explains the reason for the exception.
innerException: The exception that is the cause of the current exception. If the innerException parameter is not null, the current exception is raised in a catch block that handles the inner exception.